# 1.0 IMPORTANDO OS DADOS

In [1]:
# IMPORTANDO BIBLIOTECAS E CONECTANDO O BANCO DE DADOS

import sqlite3
import pandas as pd
 
conn = sqlite3.connect('database.db')

In [2]:
# TABELA COM TODAS AS COLUNAS
consulta_total = 'SELECT * FROM flight_activity LIMIT 5'
df_atividade = pd.read_sql_query(consulta_total, conn)
df_atividade.head()

,loyalty_number,year,month,flights_booked,flights_with_companions,total_flights,distance,points_accumulated,points_redeemed,dollar_cost_points_redeemed
0,100018,2017,1,3,0,3,1521,152.0,0,0
1,100102,2017,1,10,4,14,2030,203.0,0,0
2,100140,2017,1,6,0,6,1200,120.0,0,0
3,100214,2017,1,0,0,0,0,0.0,0,0
4,100272,2017,1,0,0,0,0,0.0,0,0

In [3]:
# CONSULTA NO BANCO DE DADOS E UNINDO TABELAS
consulta_atividade = """

    SELECT
        *
    FROM flight_activity AS fa LEFT JOIN flight_loyalty_history AS flh
    ON (fa.loyalty_number = flh.loyalty_number)

"""

df_atividade = pd.read_sql_query(consulta_atividade, conn)
df_atividade.head()

,loyalty_number,year,month,flights_booked,flights_with_companions,total_flights,distance,points_accumulated,points_redeemed,dollar_cost_points_redeemed,...,education,salary,marital_status,loyalty_card,clv,enrollment_type,enrollment_year,enrollment_month,cancellation_year,cancellation_month
0,100018,2017,1,3,0,3,1521,152.0,0,0,...,Bachelor,92552.0,Married,Aurora,7919.20,Standard,2016,8,NaN,NaN
1,100102,2017,1,10,4,14,2030,203.0,0,0,...,College,NaN,Single,Nova,2887.74,Standard,2013,3,NaN,NaN
2,100140,2017,1,6,0,6,1200,120.0,0,0,...,College,NaN,Divorced,Nova,2838.07,Standard,2016,7,NaN,NaN
3,100214,2017,1,0,0,0,0,0.0,0,0,...,Bachelor,63253.0,Married,Star,4170.57,Standard,2015,8,NaN,NaN
4,100272,2017,1,0,0,0,0,0.0,0,0,...,Bachelor,91163.0,Divorced,Star,6622.05,Standard,2014,1,NaN,NaN

# 2.0 EXERCICIOS:

In [4]:
# Selecione as colunas: loyalty_number, year, month, flights_booked, total_flights, distance e points_accumulated 

consulta_atividade = """

    SELECT
        fa.loyalty_number,
        fa.year,
        fa.month,
        fa.flights_booked,
        fa.total_flights,
        fa.distance,
        fa.points_accumulated
    FROM flight_activity as fa

"""

df_atividade = pd.read_sql_query(consulta_atividade, conn)
display(df_atividade)

,loyalty_number,year,month,flights_booked,total_flights,distance,points_accumulated
0,100018,2017,1,3,3,1521,152.0
1,100102,2017,1,10,14,2030,203.0
2,100140,2017,1,6,6,1200,120.0
3,100214,2017,1,0,0,0,0.0
4,100272,2017,1,0,0,0,0.0
...,...,...,...,...,...,...,...
405619,999902,2018,12,0,0,0,0.0
405620,999911,2018,12,0,0,0,0.0
405621,999940,2018,12,3,3,1233,123.0
405622,999982,2018,12,0,0,0,0.0
405623,999986,2018,12,0,0,0,0.0

In [5]:
#Selecione as mesmas colunas, porém, recupere somente as linhas cuja coluna distance é maior do que 2000

consulta_atividade = """

    SELECT
        fa.loyalty_number,
        fa.year,
        fa.month,
        fa.flights_booked,
        fa.total_flights,
        fa.distance,
        fa.points_accumulated
    FROM flight_activity as fa
    WHERE distance > 2000

"""

df_atividade = pd.read_sql_query(consulta_atividade, conn)
display(df_atividade)

,loyalty_number,year,month,flights_booked,total_flights,distance,points_accumulated
0,100102,2017,1,10,14,2030,203.0
1,100550,2017,1,3,3,2037,203.0
2,863070,2017,9,8,15,4245,424.0
3,100753,2017,1,8,12,3264,326.0
4,100816,2017,1,9,10,2340,234.0
...,...,...,...,...,...,...,...
122207,999272,2018,12,12,20,3460,346.0
122208,999498,2018,12,17,17,2754,275.0
122209,999550,2018,12,15,15,2985,298.0
122210,999589,2018,12,14,14,4690,469.0
122211,999631,2018,12,11,12,2244,224.0

In [6]:
#Selecione as mesmas colunas, porém, recupere somente as linhas cuja coluna distance é maior do que 2000 e a coluna month é igual a 9

consulta_atividade = """

    SELECT
        fa.loyalty_number,
        fa.year,
        fa.month,
        fa.flights_booked,
        fa.total_flights,
        fa.distance,
        fa.points_accumulated
    FROM flight_activity as fa
    WHERE distance > 2000 AND month = 9

"""

df_atividade = pd.read_sql_query(consulta_atividade, conn)
display(df_atividade)

,loyalty_number,year,month,flights_booked,total_flights,distance,points_accumulated
0,863070,2017,9,8,15,4245,424.0
1,691626,2018,9,8,15,4245,424.0
2,444931,2017,9,11,18,4428,442.0
3,409051,2018,9,11,18,4428,442.0
4,975387,2018,9,13,18,4428,442.0
...,...,...,...,...,...,...,...
10220,991442,2017,9,8,15,3255,325.0
10221,991638,2017,9,2,3,3387,338.0
10222,997370,2017,9,2,2,2086,208.0
10223,997710,2017,9,9,9,3285,328.0
10224,998072,2017,9,2,4,2212,221.0

In [7]:
#Selecione as colunas: loyalty_number, country, city, gender e loyalty_card, salary da tabela “flight_loyalty_history”. 
consulta_atividade = """

    SELECT
        flh.loyalty_number,
        flh.country,
        flh.city, 
        flh.gender,
        flh.loyalty_card
    FROM flight_loyalty_history as flh

"""

df_atividade = pd.read_sql_query(consulta_atividade, conn)
display(df_atividade)

       loyalty_number country        city  gender loyalty_card
0              480934  Canada     Toronto  Female         Star
1              549612  Canada    Edmonton    Male         Star
2              429460  Canada   Vancouver    Male         Star
3              608370  Canada     Toronto    Male         Star
4              530508  Canada        Hull    Male         Star
...               ...     ...         ...     ...          ...
16732          823768  Canada   Vancouver  Female         Star
16733          680886  Canada      Regina  Female         Star
16734          776187  Canada   Vancouver    Male         Star
16735          906428  Canada  Whitehorse    Male         Star
16736          652627  Canada    Winnipeg  Female         Star

[16737 rows x 5 columns]

In [8]:
# Selecione as mesmas colunas, porém, recupere somente as linhas cuja coluna gender é igual a Female
consulta_atividade = """

    SELECT
        flh.loyalty_number,
        flh.country,
        flh.city, 
        flh.gender,
        flh.loyalty_card
    FROM flight_loyalty_history as flh
    WHERE flh.gender = 'Female'
"""

df_atividade = pd.read_sql_query(consulta_atividade, conn)
display(df_atividade)

      loyalty_number country          city  gender loyalty_card
0             480934  Canada       Toronto  Female         Star
1             927943  Canada       Toronto  Female         Star
2             852392  Canada      Montreal  Female         Star
3             932823  Canada     Vancouver  Female         Star
4             144514  Canada  Dawson Creek  Female         Star
...              ...     ...           ...     ...          ...
8405          302460  Canada      Whistler  Female         Star
8406          672917  Canada       Toronto  Female         Star
8407          823768  Canada     Vancouver  Female         Star
8408          680886  Canada        Regina  Female         Star
8409          652627  Canada      Winnipeg  Female         Star

[8410 rows x 5 columns]

# 3.0 INSPECIONANDO OS DADOS

In [12]:
# Verificando o numero de linha e colunas da tabela
consulta_atividade = """

    SELECT
        *
    FROM flight_activity AS fa LEFT JOIN flight_loyalty_history AS flh
    ON (fa.loyalty_number = flh.loyalty_number)

"""

df_atividade = pd.read_sql_query(consulta_atividade, conn)
df_atividade.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 405624 entries, 0 to 405623
Data columns (total 26 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   loyalty_number               405624 non-null  int64
 1   year                         405624 non-null  int64
 2   month                        405624 non-null  int64
 3   flights_booked               405624 non-null  int64
 4   flights_with_companions      405624 non-null  int64
 5   total_flights                405624 non-null  int64
 6   distance                     405624 non-null  int64
 7   points_accumulated           405624 non-null  float64
 8   points_redeemed              405624 non-null  int64
 9   dollar_cost_points_redeemed  405624 non-null  int64
 10  loyalty_number               405624 non-null  int64
 11  country                      405624 non-null  object
 12  province                     405624 non-null  object
 13  city                         405624 non-null  object
 14  postal_code                  405624 non-null  object
 15  gender                       405624 non-null  object
 16  education                    405624 non-null  object
 17  salary                       302952 non-null  float64
 18  marital_status               405624 non-null  object
 19  loyalty_card                 405624 non-null  object
 20  clv                          405624 non-null  float64
 21  enrollment_type              405624 non-null  object
 22  enrollment_year              405624 non-null  int64
 23  enrollment_month             405624 non-null  int64
 24  cancellation_year            50064 non-null   float64
 25  cancellation_month           50064 non-null   float64
dtypes: float64(5), int64(12), object(9)
memory usage: 80.5+ MB